{"format": "graph-model", "generatedBy": "2.9.1", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "500"}, {"size": "500"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "4"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "65536"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "65536"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "65536"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_7/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "13"}, {"size": "4"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_8/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "4"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_13/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_13/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_12/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_12/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_11/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_11/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_10/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_10/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/dense_2/MatMul", "op": "MatMul", "input": ["input_1", "StatefulPartitionedCall/generator_1/sequential_2/dense_2/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/dense_2/MatMul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/batchnorm/mul_1", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_12/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_12/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Shape", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/1", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/2", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_12/LeakyRelu", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/Shape", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/2", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/conv2d_transpose", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_13/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_13/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/Shape", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/2", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_13/LeakyRelu"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/conv2d_transpose", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_14/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_14/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/Shape", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack/1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack/2", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_14/LeakyRelu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_10/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/conv2d_transpose", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_10/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_10/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_10/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_10/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_15/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_10/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_15/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/Shape", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack/1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack/2", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_15/LeakyRelu"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_11/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/conv2d_transpose", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_11/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_11/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_11/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_11/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_16/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_11/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_16/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/Shape", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack/1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack/2", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_16/LeakyRelu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_12/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/conv2d_transpose", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_12/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_12/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_12/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_12/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_17/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_12/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_17/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/Shape", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack/1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack/2", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_17/LeakyRelu"], "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_13/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/conv2d_transpose", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_13/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_13/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_13/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_13/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_18/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_13/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_18/LeakyRelu", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_7/Conv2D/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_8/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_7/Relu", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_8/Conv2D/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_8/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_8/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_11/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 4, 16], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.2600800421671872, "scale": 7.588924810107298e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_10/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 16, 32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.21422053389975998, "scale": 7.317774608859738e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_9/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.19895195070817012, "scale": 8.07926703383432e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 64, 256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.2698733306121178, "scale": 8.236131797604842e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.28993122618185846, "scale": 8.338785302478025e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.3312247458080537, "scale": 8.972389907033636e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/dense_2/MatMul/ReadVariableOp", "shape": [100, 65536], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.19176772720341534, "scale": 5.947208162611733e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/batchnorm/mul", "shape": [65536], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.24089966714382172, "scale": 3.9498045377730596e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/batchnorm/sub", "shape": [65536], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.499995871907906, "scale": 1.4829631982082868e-05, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_7/Conv2D/ReadVariableOp", "shape": [13, 13, 4, 4], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.24777452870220018, "scale": 8.742309247837138e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_7/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.020142588764429092, "scale": 1.0943650048812467e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_8/Conv2D/ReadVariableOp", "shape": [5, 5, 4, 3], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.31430214776971516, "scale": 8.415726772423894e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_8/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.10373542457818985, "scale": 1.0863921958266748e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Offset", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.07616260697569338, "scale": 2.198435716882963e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_13/FusedBatchNormV3/Scaled", "shape": [4], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.4774860441684723, "scale": 3.356887026910716e-07, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_13/FusedBatchNormV3/Offset", "shape": [4], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.03462885692715645, "scale": 4.12483393584344e-07, "original_dtype": "float32"}}, {"name": 