{"format": "graph-model", "generatedBy": "2.9.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "16384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_5/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_5/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_6/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "3"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_6/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_6/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/dense_2/MatMul", "op": "MatMul", "input": ["input_1", "StatefulPartitionedCall/generator_1/sequential_2/dense_2/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_5/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/dense_2/MatMul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_5/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_5/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_5/batchnorm/mul_1", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_5/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_10/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_5/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_10/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Shape", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/1", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/2", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/Shape", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack/1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack/2", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_6/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/conv2d_transpose", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_6/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_6/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_6/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_6/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_11/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_6/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_11/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/Shape", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack/1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack/2", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_11/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/conv2d_transpose", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_12/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_12/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/Shape", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/2", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_12/LeakyRelu"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/conv2d_transpose", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_13/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_13/LeakyRelu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/Shape", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/1", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/2", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_13/LeakyRelu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/conv2d_transpose", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_14/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_6/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/generator_1/sequential_2/leaky_re_lu_14/LeakyRelu", "StatefulPartitionedCall/generator_1/sequential_2/conv2d_6/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_6/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_6/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/generator_1/sequential_2/conv2d_6/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_7/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 8, 16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_6/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 16, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 32, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "shape": [5, 5, 64, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/dense_2/MatMul/ReadVariableOp", "shape": [100, 16384], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_5/batchnorm/mul", "shape": [16384], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_5/batchnorm/sub", "shape": [16384], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/reshape_1/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/conv2d_6/Conv2D/ReadVariableOp", "shape": [3, 3, 8, 3], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Scaled", "shape": [8], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_9/FusedBatchNormV3/Offset", "shape": [8], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Scaled", "shape": [16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_8/FusedBatchNormV3/Offset", "shape": [16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_7/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_6/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator_1/sequential_2/batch_normalization_6/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}]}]}